<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to define Wi-Fi settings</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/wifi</string>
	<key>pfm_domain</key>
	<string>com.apple.wifi.managed</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_ios_min</key>
	<string>4.0</string>
	<key>pfm_last_modified</key>
	<date>2022-07-24T17:19:59Z</date>
	<key>pfm_macos_min</key>
	<string>10.7</string>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
		<string>macOS</string>
		<string>tvOS</string>
		<string>watchOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'true', the device joins the network automatically.
If 'false', the user must tap the network name to join it.
Available in iOS 5.0 and later, and in macOS 10.7 and later.</string>
			<key>pfm_ios_min</key>
			<string>5.0</string>
			<key>pfm_macos_min</key>
			<string>10.7</string>
			<key>pfm_name</key>
			<string>AutoJoin</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
			</array>
			<key>pfm_targets</key>
			<array/>
			<key>pfm_title</key>
			<string>Auto Join</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', Captive Network detection will be bypassed when the device connects to the network.
Available in iOS 10.0 and later.</string>
			<key>pfm_ios_min</key>
			<string>10.0</string>
			<key>pfm_name</key>
			<string>CaptiveBypass</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_targets</key>
			<array/>
			<key>pfm_title</key>
			<string>Disable Captive Network Detection</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true,' disables MAC address randomization for a Wi-Fi network while associated with that network. This feature also shows a privacy warning in Settings indicating that the network has reduced privacy protections.
This value is only locked when the profile is installed by MDM. If the profile is manually installed, the value is set but the user can change it.
Available in iOS 14 and later, and watchOS 7 and later.</string>
			<key>pfm_ios_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>DisableAssociationMACRandomization</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
				<string>tvOS</string>
				<string>watchOS</string>
			</array>
			<key>pfm_targets</key>
			<array/>
			<key>pfm_title</key>
			<string>Disable MAC address randomization during association</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_watchos_min</key>
			<string>7.0</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>Hotspot2</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The operator name to display when connected to this network. Used only with Wi-Fi Hotspot 2.0 access points.
Available in iOS 7.0 and later, and in macOS 10.9 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>IsHotspot</string>
						</dict>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Hotspot2</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_macos_min</key>
			<string>10.9</string>
			<key>pfm_name</key>
			<string>DisplayedOperatorName</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_targets</key>
			<array/>
			<key>pfm_title</key>
			<string>Displayed Operator Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>Hotspot2</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The primary domain of the tunnel.
Available in iOS 7.0 and later, and in macOS 10.9 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>IsHotspot</string>
						</dict>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Hotspot2</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_macos_min</key>
			<string>10.9</string>
			<key>pfm_name</key>
			<string>DomainName</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_targets</key>
			<array/>
			<key>pfm_title</key>
			<string>Domain Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The enterprise network configuration.</string>
			<key>pfm_name</key>
			<string>EAPClientConfiguration</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>The EAP types accepted.</string>
					<key>pfm_name</key>
					<string>AcceptEAPTypes</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>An integer representing an EAP type, inside of the Accept EAP Types array.</string>
							<key>pfm_name</key>
							<string>EAPType</string>
							<key>pfm_range_list</key>
							<array>
								<integer>13</integer>
								<integer>17</integer>
								<integer>21</integer>
								<integer>25</integer>
								<integer>43</integer>
								<integer>18</integer>
								<integer>23</integer>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>TLS</string>
								<string>LEAP</string>
								<string>TTLS</string>
								<string>PEAP</string>
								<string>EAP-FAST</string>
								<string>EAP-SIM</string>
								<string>EAP-AKA</string>
							</array>
							<key>pfm_title</key>
							<string>EAP Type</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Accept EAP Types</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Username. If not provided, the user may be prompted during login.</string>
					<key>pfm_name</key>
					<string>UserName</string>
					<key>pfm_title</key>
					<string>Username</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<true/>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.OneTimeUserPassword</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>Password. If not provided, the user may be prompted during login.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<true/>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.OneTimeUserPassword</string>
								</dict>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.OneTimeUserPassword</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>UserPassword</string>
					<key>pfm_sensitive</key>
					<true/>
					<key>pfm_title</key>
					<string>Password</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If set, the user will be prompted for a password each time they connect to the network.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>17</integer>
										<integer>21</integer>
										<integer>25</integer>
										<integer>43</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>OneTimeUserPassword</string>
					<key>pfm_title</key>
					<string>Per-Connection Password</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Array of UUIDs corresponding to the trusted certificates for this authentication.</string>
					<key>pfm_name</key>
					<string>PayloadCertificateAnchorUUID</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>A UUID for a trusted certificate</string>
							<key>pfm_format</key>
							<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
							<key>pfm_name</key>
							<string>CertificateAnchorUUID</string>
							<key>pfm_title</key>
							<string>Individual Certificate Anchor UUID</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Certificate Anchor UUID</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Certificate Common Names expected from authentication server. The wildcard * can be used to match a range of strings.</string>
					<key>pfm_name</key>
					<string>TLSTrustedServerNames</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>An item in the TLS Trusted Server Names array representing a Common Name of a server certificate.</string>
							<key>pfm_name</key>
							<string>TLSTrustedServerName</string>
							<key>pfm_title</key>
							<string>Individual Trusted TLS Server Name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Trusted Server Certificate Names</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Allows a dynamic trust decision by the user.</string>
					<key>pfm_ios_deprecated</key>
					<string>7.1.2</string>
					<key>pfm_ios_max</key>
					<string>7.1.2</string>
					<key>pfm_name</key>
					<string>TLSAllowTrustExceptions</string>
					<key>pfm_title</key>
					<string>Allow Trust Exceptions</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_contains_any</key>
									<array>
										<integer>21</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_default</key>
					<string>MSCHAPv2</string>
					<key>pfm_description</key>
					<string>Specifies the inner authentication used by the TTLS module.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>21</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>TTLSInnerAuthentication</string>
					<key>pfm_range_list</key>
					<array>
						<string>PAP</string>
						<string>EAP</string>
						<string>CHAP</string>
						<string>MSCHAP</string>
						<string>MSCHAPv2</string>
					</array>
					<key>pfm_title</key>
					<string>Inner Authentication</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Externally visible identification (for TTLS, PEAP, and EAP-FAST). This string is used instead of the user's identity outside the encrypted tunnel. This value can be used to mask the true identity of the person using the network.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>21</integer>
										<integer>25</integer>
										<integer>43</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>OuterIdentity</string>
					<key>pfm_title</key>
					<string>Outer Identity</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>21</integer>
										<integer>25</integer>
										<integer>43</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>11.0</string>
					<key>pfm_macos_min</key>
					<string>10.13</string>
					<key>pfm_name</key>
					<string>TLSMinimumVersion</string>
					<key>pfm_range_list</key>
					<array>
						<string>1.0</string>
						<string>1.1</string>
						<string>1.2</string>
					</array>
					<key>pfm_title</key>
					<string>TLS Minimum Version</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>21</integer>
										<integer>25</integer>
										<integer>43</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>11.0</string>
					<key>pfm_macos_min</key>
					<string>10.13</string>
					<key>pfm_name</key>
					<string>TLSMaximumVersion</string>
					<key>pfm_range_list</key>
					<array>
						<string>1.0</string>
						<string>1.1</string>
						<string>1.2</string>
					</array>
					<key>pfm_title</key>
					<string>TLS Maximum Version</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If set, the device will use an existing PAC if it's present. Otherwise the server must present its identity using a certificate.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>43</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>EAPFASTUsePAC</string>
					<key>pfm_title</key>
					<string>Use PAC</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If set, allows PAC provisioning.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>43</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<true/>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.EAPFASTUsePAC</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>EAPFASTProvisionPAC</string>
					<key>pfm_title</key>
					<string>Provision PAC</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If set, provisions the device anonymously. Note that there are known man-in-the-middle attacks for anonymous provisioning.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>43</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<true/>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.EAPFASTProvisionPAC</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>EAPFASTProvisionPACAnonymously</string>
					<key>pfm_title</key>
					<string>Provision PAC Anonymously</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>3</integer>
					<key>pfm_description</key>
					<string>The minimum number of RAND values accepted from the server. 3 is the default, and 2 is allowed, but offers less security.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_contains_any</key>
									<array>
										<integer>18</integer>
									</array>
									<key>pfm_target</key>
									<string>EAPClientConfiguration.AcceptEAPTypes</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>EAPSIMNumberOfRANDs</string>
					<key>pfm_range_list</key>
					<array>
						<integer>2</integer>
						<integer>3</integer>
					</array>
					<key>pfm_title</key>
					<string>Number of RANDs</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Use an alternate set of credentials when in System mode (AKA not a loginwindow profile). This can be used to tell EAPOLClient to use the computer password in a bound active directory scenario for authentication.</string>
					<key>pfm_name</key>
					<string>SystemModeCredentialsSource</string>
					<key>pfm_range_list</key>
					<array>
						<string>ActiveDirectory</string>
					</array>
					<key>pfm_title</key>
					<string>System Profile Credentials Source</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>This indicates if the connection should try to use the OpenDirectory machine credentials.</string>
					<key>pfm_name</key>
					<string>SystemModeUseOpenDirectoryCredentials</string>
					<key>pfm_title</key>
					<string>Use OpenDirectory System Profile Credentials</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>EAP Client Configuration</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'true', enables IPv6 on this interface.</string>
			<key>pfm_name</key>
			<string>EnableIPv6</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Any</string>
			<key>pfm_description</key>
			<string>The encryption type for the network.

WPA specifies WPA only; WPA2 applies to both encryption types.
Available in iOS 4.0 and later, and in all versions of macOS. The 'None' value is available in iOS 5.0 and later, and the 'WPA2' value is available in iOS 8.0 and later.</string>
			<key>pfm_ios_min</key>
			<string>4.0</string>
			<key>pfm_name</key>
			<string>EncryptionType</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_range_list</key>
			<array>
				<string>WEP</string>
				<string>WPA</string>
				<string>WPA2</string>
				<string>WPA3</string>
				<string>Any</string>
				<string>None</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>None</string>
				<string>WEP</string>
				<string>WPA/WPA2</string>
				<string>WPA2</string>
				<string>WPA3</string>
				<string>Any</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Encryption Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The HESSID used for Wi-Fi Hotspot 2.0 negotiation.</string>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_name</key>
			<string>HESSID</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
			</array>
			<key>pfm_targets</key>
			<array/>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', defines this network as hidden.</string>
			<key>pfm_name</key>
			<string>HIDDEN_NETWORK</string>
			<key>pfm_title</key>
			<string>Hidden</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The wireless interface to use</string>
			<key>pfm_name</key>
			<string>Interface</string>
			<key>pfm_range_list</key>
			<array>
				<string>AnyEthernet</string>
				<string>FirstEthernet</string>
				<string>FirstActiveEthernet</string>
				<string>SecondEthernet</string>
				<string>SecondActiveEthernet</string>
				<string>ThirdEthernet</string>
				<string>ThirdActiveEthernet</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Any Ethernet</string>
				<string>First Ethernet</string>
				<string>First Active Ethernet</string>
				<string>Second Ethernet</string>
				<string>Second Active Ethernet</string>
				<string>Third Ethernet</string>
				<string>Third Active Ethernet</string>
			</array>
			<key>pfm_title</key>
			<string>Interface</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_contains_any</key>
							<array>
								<string>Hotspot</string>
								<string>Hotspot2</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the device treats the network as a hotspot.
Available in iOS 7.0 and later, and in macOS 10.9 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_contains_any</key>
							<array>
								<string>Hotspot</string>
								<string>Hotspot2</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_macos_min</key>
			<string>10.9</string>
			<key>pfm_name</key>
			<string>IsHotspot</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_targets</key>
			<array/>
			<key>pfm_title</key>
			<string>Is Hotspot</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of Mobile Country Code/Mobile Network Code (MCC/MNC) pairs used for Wi-Fi Hotspot 2.0 negotiation. Each string must contain exactly six digits.
Available in iOS 7.0 and later. This feature is not supported in macOS.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>IsHotspot</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>DomainName</string>
						</dict>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Hotspot2</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_name</key>
			<string>MCCAndMNCs</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_format</key>
					<string>^[0-9]{6}$</string>
					<key>pfm_name</key>
					<string>MCCAndMNC</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_targets</key>
			<array/>
			<key>pfm_title</key>
			<string>MCC/MNCs</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of Network Access Identifier Realm names used for Wi-Fi Hotspot 2.0 negotiation.
Available in iOS 7.0 and later, and in macOS 10.9 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>IsHotspot</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>DomainName</string>
						</dict>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Hotspot2</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_macos_min</key>
			<string>10.9</string>
			<key>pfm_name</key>
			<string>NAIRealmNames</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>NAIRealmName</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_targets</key>
			<array/>
			<key>pfm_title</key>
			<string>Realm Names</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Type of network interface on the device.</string>
			<key>pfm_excluded</key>
			<true/>
			<key>pfm_name</key>
			<string>PFC_InterfaceSelector</string>
			<key>pfm_range_list</key>
			<array>
				<string>BuiltInWireless</string>
				<string>Hotspot</string>
				<string>Hotspot2</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Wi-Fi</string>
				<string>Legacy Hotspot</string>
				<string>Passpoint</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Network Interface</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The password for the access point.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>EAPClientConfiguration</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>Password</string>
			<key>pfm_sensitive</key>
			<true/>
			<key>pfm_title</key>
			<string>Password</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_contains_any</key>
							<array>
								<integer>13</integer>
							</array>
							<key>pfm_target</key>
							<string>EAPClientConfiguration.AcceptEAPTypes</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The UUID of the certificate payload within the same profile to use for the client credential.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_contains_any</key>
							<array>
								<integer>13</integer>
								<integer>21</integer>
								<integer>25</integer>
								<integer>43</integer>
							</array>
							<key>pfm_target</key>
							<string>EAPClientConfiguration.AcceptEAPTypes</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadCertificateUUID</string>
			<key>pfm_title</key>
			<string>Certificate UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Configures Wi-Fi settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Wi-Fi</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.wifi.managed</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.wifi.managed</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'true', allows connecting directly to the destination if the PAC file is unreachable.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Auto</string>
							</array>
							<key>pfm_target</key>
							<string>ProxyType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ProxyPACFallbackAllowed</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_targets</key>
			<array/>
			<key>pfm_title</key>
			<string>Proxy PAC Fallback Allowed</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The URL of the PAC file that defines the proxy configuration.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Auto</string>
							</array>
							<key>pfm_target</key>
							<string>ProxyType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ProxyPACURL</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_targets</key>
			<array/>
			<key>pfm_title</key>
			<string>Proxy Username</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The password used to authenticate to the proxy server.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Manual</string>
							</array>
							<key>pfm_target</key>
							<string>ProxyType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ProxyPassword</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
			</array>
			<key>pfm_sensitive</key>
			<true/>
			<key>pfm_targets</key>
			<array/>
			<key>pfm_title</key>
			<string>Proxy Password</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>Manual</string>
							</array>
							<key>pfm_target</key>
							<string>ProxyType</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>ProxyType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The proxy server's network address.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Manual</string>
							</array>
							<key>pfm_target</key>
							<string>ProxyType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ProxyServer</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_targets</key>
			<array/>
			<key>pfm_title</key>
			<string>Proxy Server</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>Manual</string>
							</array>
							<key>pfm_target</key>
							<string>ProxyType</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>ProxyType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The proxy server's port number.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Manual</string>
							</array>
							<key>pfm_target</key>
							<string>ProxyType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ProxyServerPort</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_range_max</key>
			<integer>65535</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_targets</key>
			<array/>
			<key>pfm_title</key>
			<string>Proxy Server Port</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>None</string>
			<key>pfm_description</key>
			<string>The proxy type, if any, to use. If you choose the manual proxy type, you need the proxy server address, including its port and optionally a user name and password into the proxy server. If you choose the auto proxy type, you can enter a proxy autoconfiguration (PAC) URL.
Available in iOS 5.0 and later, and on all versions of macOS.</string>
			<key>pfm_ios_min</key>
			<string>5.0</string>
			<key>pfm_name</key>
			<string>ProxyType</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
			</array>
			<key>pfm_range_list</key>
			<array>
				<string>None</string>
				<string>Manual</string>
				<string>Auto</string>
			</array>
			<key>pfm_targets</key>
			<array/>
			<key>pfm_title</key>
			<string>Proxy Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The user name used to authenticate to the proxy server.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Manual</string>
							</array>
							<key>pfm_target</key>
							<string>ProxyType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ProxyUsername</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_targets</key>
			<array/>
			<key>pfm_title</key>
			<string>Proxy Username</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>A dictionary that contains the list of apps that are allowed to benefit from L2 and L3 marking. When this dictionary isn't present, all apps are allowed to use L2 and L3 marking when the Wi-Fi network supports Cisco QoS fast lane.
Available in iOS 10.0 and later, and in macOS 10.13 and later.</string>
			<key>pfm_ios_min</key>
			<string>10.0</string>
			<key>pfm_macos_min</key>
			<string>10.13</string>
			<key>pfm_name</key>
			<string>QoSMarkingPolicy</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Enable any kind of QoS marking.</string>
					<key>pfm_name</key>
					<string>QoSMarkingEnabled</string>
					<key>pfm_title</key>
					<string>Allow QoS marking</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Enable QoS for WiFi Calling, FaceTime, SMS, etc.</string>
					<key>pfm_name</key>
					<string>QoSMarkingAppleAudioVideoCalls</string>
					<key>pfm_title</key>
					<string>QoS marking for audio/video calls</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Add specific apps to an allow list for QoS marking.</string>
					<key>pfm_ios_min</key>
					<string>14.5</string>
					<key>pfm_macos_min</key>
					<string>11.3</string>
					<key>pfm_name</key>
					<string>QoSMarkingAllowListAppIdentifiers</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_title</key>
							<string>Allow List App</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Allow List App Identifiers</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Add specific apps to an allow list for QoS marking.</string>
					<key>pfm_ios_deprecated</key>
					<string>14.5</string>
					<key>pfm_macos_deprecated</key>
					<string>11.3</string>
					<key>pfm_name</key>
					<string>QoSMarkingWhitelistedAppIdentifiers</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_title</key>
							<string>Allowlisted App</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Allowlisted App Identifiers</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
			</array>
			<key>pfm_targets</key>
			<array/>
			<key>pfm_title</key>
			<string>QoS Marking Policy</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of Roaming Consortium Organization Identifiers used for Wi-Fi Hotspot 2.0 negotiation.
Available in iOS 7.0 and later, and in macOS 10.9 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>IsHotspot</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>DomainName</string>
						</dict>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Hotspot2</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_macos_min</key>
			<string>10.9</string>
			<key>pfm_name</key>
			<string>RoamingConsortiumOIs</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_format</key>
					<string>^([0-9A-Za-z]{6})|([0-9A-Za-z]{9})$</string>
					<key>pfm_name</key>
					<string>RoamingConsortiumOI</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_targets</key>
			<array/>
			<key>pfm_title</key>
			<string>Roaming OIs</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_contains_any</key>
							<array>
								<string>BuiltInWireless</string>
								<string>Hotspot</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>DomainName</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The SSID of the Wi-Fi network to be used. In iOS 7.0 and later, the SSID is optional if a 'DomainName' value is provided.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>Hotspot2</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_name</key>
			<string>SSID_STR</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
			</array>
			<key>pfm_targets</key>
			<array/>
			<key>pfm_title</key>
			<string>SSID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', allows connection to roaming service providers.
Available in iOS 7.0 and later, and in macOS 10.9 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>IsHotspot</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>DomainName</string>
						</dict>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>Hotspot2</string>
							</array>
							<key>pfm_target</key>
							<string>PFC_InterfaceSelector</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_macos_min</key>
			<string>10.9</string>
			<key>pfm_name</key>
			<string>ServiceProviderRoamingEnabled</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_targets</key>
			<array/>
			<key>pfm_title</key>
			<string>Roaming Enable</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of strings that contain the type of connection mode to be attached.</string>
			<key>pfm_macos_min</key>
			<string>10.7</string>
			<key>pfm_name</key>
			<string>SetupModes</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
				<string>tvOS</string>
				<string>watchOS</string>
			</array>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>SetupMode</string>
					<key>pfm_range_list</key>
					<array>
						<string>System</string>
						<string>Loginwindow</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>System</string>
						<string>Login Window</string>
					</array>
					<key>pfm_title</key>
					<string>Setup Mode</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_targets</key>
			<array/>
			<key>pfm_title</key>
			<string>EAP Setup Modes</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_type_input</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', allows for two-factor authentication for EAP-TTLS, PEAP, or EAP-FAST.
If 'false', allows for zero-factor authentication for EAP-TLS.</string>
			<key>pfm_ios_min</key>
			<string>7.0</string>
			<key>pfm_name</key>
			<string>TLSCertificateRequired</string>
			<key>pfm_title</key>
			<string>Certificate Required</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Wi-Fi</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.wifi.managed</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.wifi.managed</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array/>
	<key>pfm_title</key>
	<string>Wi-Fi</string>
	<key>pfm_tvos_min</key>
	<string>5.1</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>10</integer>
	<key>pfm_watchos_min</key>
	<string>3.2</string>
</dict>
</plist>
