<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Configures Security Preferences:Privacy settings</string>
	<key>pfm_domain</key>
	<string>com.apple.TCC.configuration-profile-policy</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2022-07-24T17:19:59Z</date>
	<key>pfm_macos_min</key>
	<string>10.14</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Privacy Preferences Policy Control settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Privacy Preferences Policy Control</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.TCC.configuration-profile-policy</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.TCC.configuration-profile-policy</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>A dictionary whose keys are limited to the privacy policy control services.  In the case of conflicting specifications, the most restrictive setting (deny) is used.</string>
			<key>pfm_name</key>
			<string>Services</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description_reference</key>
					<string>Specifies the policies for the app via the Accessibility subsystem.</string>
					<key>pfm_macos_min</key>
					<string>10.14</string>
					<key>pfm_name</key>
					<string>Accessibility</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>Services</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of Identifier value.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, access is granted. Otherwise the process does not have access. The user is not prompted and cannot change this value.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not Used</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Accessibility</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>Specifies the policies for the app sending restricted AppleEvents to another process.</string>
					<key>pfm_macos_min</key>
					<string>10.14</string>
					<key>pfm_name</key>
					<string>AppleEvents</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>Services</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of Identifier value.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, access is granted. Otherwise the process does not have access. The user is not prompted and cannot change this value.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The identifier of the process receiving an ApplEvent sent by the Identifier process.</string>
									<key>pfm_name</key>
									<string>AEReceiverIdentifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>AEReceiverIdentifier</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of AEReceiverIdentifier value.</string>
									<key>pfm_name</key>
									<string>AEReceiverIdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>AEReceiverIdentifierType</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Code requirement for the receiving binary.</string>
									<key>pfm_name</key>
									<string>AEReceiverCodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>AEReceiverCodeRequirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not Used</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>AppleEvents</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services.AppleEvents</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>Specifies the policies for calendar information managed by the Calendar.app.</string>
					<key>pfm_macos_min</key>
					<string>10.14</string>
					<key>pfm_name</key>
					<string>Calendar</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>Services</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of Identifier value.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, access is granted. Otherwise the process does not have access. The user is not prompted and cannot change this value.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not Used</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Calendar</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>A system camera. Access to the camera cannot be given in a profile; it can only be denied.</string>
					<key>pfm_macos_min</key>
					<string>10.14</string>
					<key>pfm_name</key>
					<string>Camera</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>Services</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of Identifier value.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, access is granted. Otherwise the process does not have access. The user is not prompted and cannot change this value.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not Used</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Camera</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>Specifies the policies for contact information managed by the Contacts.app.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>AddressBook</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>Services</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of Identifier value.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, access is granted. Otherwise the process does not have access. The user is not prompted and cannot change this value.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not Used</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Contacts</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>Allows a File Provider application to know when the user is using files managed by the File Provider.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>FileProviderPresence</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>Services</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of Identifier value.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, access is granted. Otherwise the process does not have access. The user is not prompted and cannot change this value.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not Used</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>Allows the application to use CoreGraphics and HID APIs to listen to (receive) CGEvents and HID events from all processes. Access to these events cannot be given in a profile; it can only be denied.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>ListenEvent</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>Services</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of Identifier value.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, access is granted. Otherwise the process does not have access. The user is not prompted and cannot change this value.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not Used</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>Allows the application to access Apple Music, music and video activity, and the media library.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>MediaLibrary</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>Services</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of Identifier value.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, access is granted. Otherwise the process does not have access. The user is not prompted and cannot change this value.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not Used</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>A system microphone. Access to the microphone cannot be given in a profile; it can only be denied.</string>
					<key>pfm_macos_min</key>
					<string>10.14</string>
					<key>pfm_name</key>
					<string>Microphone</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>Services</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of Identifier value.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, access is granted. Otherwise the process does not have access. The user is not prompted and cannot change this value.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not Used</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Microphone</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>Pictures managed by Photos.app in ~/Pictures/.photoslibrary.</string>
					<key>pfm_macos_min</key>
					<string>10.14</string>
					<key>pfm_name</key>
					<string>Photos</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>Services</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of Identifier value.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, access is granted. Otherwise the process does not have access. The user is not prompted and cannot change this value.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not Used</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Photos</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Specifies the policies for the application to use CoreGraphics APIs to send CGEvents to the system event stream.</string>
					<key>pfm_macos_min</key>
					<string>10.14</string>
					<key>pfm_name</key>
					<string>PostEvent</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>Services</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of Identifier value.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, access is granted. Otherwise the process does not have access. The user is not prompted and cannot change this value.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not Used</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>PostEvent</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>Specifies the policies for reminders information managed by the Reminders app.</string>
					<key>pfm_macos_min</key>
					<string>10.14</string>
					<key>pfm_name</key>
					<string>Reminders</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>Services</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of Identifier value.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, access is granted. Otherwise the process does not have access. The user is not prompted and cannot change this value.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not Used</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Reminders</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>Allows the application access to all protected files.</string>
					<key>pfm_macos_min</key>
					<string>10.14</string>
					<key>pfm_name</key>
					<string>SystemPolicyAllFiles</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>Services</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of Identifier value.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, access is granted. Otherwise the process does not have access. The user is not prompted and cannot change this value.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not Used</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>SystemPolicyAllFiles</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>Allows the application to capture (read) the contents of the system display. Access to the contents cannot be given in a profile; it can only be denied.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>ScreenCapture</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>Services</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of Identifier value.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, access is granted. Otherwise the process does not have access. The user is not prompted and cannot change this value.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not Used</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>Allows the application to use the system Speech Recognition facility and to send speech data to Apple.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>SpeechRecognition</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>Services</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of Identifier value.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, access is granted. Otherwise the process does not have access. The user is not prompted and cannot change this value.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not Used</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>Allows the application to access files in the user's Desktop folder.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>SystemPolicyDesktopFolder</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>Services</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of Identifier value.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, access is granted. Otherwise the process does not have access. The user is not prompted and cannot change this value.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not Used</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>Allows the application to access files in the user's Documents folder.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>SystemPolicyDocumentsFolder</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>Services</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of Identifier value.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, access is granted. Otherwise the process does not have access. The user is not prompted and cannot change this value.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not Used</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>Allows the application to access files in the user's Downloads folder.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>SystemPolicyDownloadsFolder</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>Services</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of Identifier value.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, access is granted. Otherwise the process does not have access. The user is not prompted and cannot change this value.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not Used</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>Allows the application to access files on network volumes.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>SystemPolicyNetworkVolumes</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>Services</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of Identifier value.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, access is granted. Otherwise the process does not have access. The user is not prompted and cannot change this value.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not Used</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>Allows the application to access files on removable volumes.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>SystemPolicyRemovableVolumes</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>Services</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of Identifier value.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, access is granted. Otherwise the process does not have access. The user is not prompted and cannot change this value.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not Used</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>Allows the application access to some files used in system administration.</string>
					<key>pfm_macos_min</key>
					<string>10.14</string>
					<key>pfm_name</key>
					<string>SystemPolicySysAdminFiles</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>Services</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of Identifier value.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If set to true, access is granted. Otherwise the process does not have access. The user is not prompted and cannot change this value.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not Used</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>SystemPolicySysAdminFiles</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Services</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Privacy Preferences Policy Control</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.TCC.configuration-profile-policy</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.TCC.configuration-profile-policy</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Privacy Preferences Policy Control</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_user_approved</key>
	<true/>
	<key>pfm_version</key>
	<integer>6</integer>
</dict>
</plist>
