<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Google Drive File Stream settings</string>
	<key>pfm_documentation_url</key>
	<string>https://support.google.com/a/answer/7644837</string>
	<key>pfm_domain</key>
	<string>com.google.drivefs.settings</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>exclusive</string>
	<key>pfm_last_modified</key>
	<date>2020-08-23T16:50:23Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Google Drive File Stream preferences</string>
			<key>pfm_description</key>
			<string>Description of the payload.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Google Drive File Stream</string>
			<key>pfm_description</key>
			<string>Name of the payload.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.google.drivefs.settings</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier.</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.google.drivefs.settings</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload. (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>Proxy Settings</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>General</key>
				<array>
					<string>AutoStartOnLogin</string>
					<string>BandwidthRxKBPS</string>
					<string>BandwidthTxKBPS</string>
					<string>ContentCachePath</string>
					<string>ContentCacheMaxKbytes</string>
					<string>DefaultMountPoint</string>
					<string>DisableMeetOutlookPlugin</string>
					<string>DisableOutlookPlugin</string>
					<string>DisableRealTimePresence</string>
					<string>ForceBrowserAuth</string>
					<string>MinFreeDiskSpaceKBytes</string>
				</array>
				<key>Proxy Settings</key>
				<array>
					<string>DirectConnection</string>
					<string>DisableCRLCheck</string>
					<string>DisableSSLValidation</string>
					<string>TrustedRootCertsFile</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable string containing the name of the organization that provided the profile.
The payload organization for a payload need not match the payload organization in the enclosing profile.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Start Drive File Stream automatically on session login.</string>
			<key>pfm_name</key>
			<string>AutoStartOnLogin</string>
			<key>pfm_title</key>
			<string>Auto Start on Login</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Maximum downstream kilobytes per second.</string>
			<key>pfm_name</key>
			<string>BandwidthRxKBPS</string>
			<key>pfm_title</key>
			<string>Max Downstream Bandwidth</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>kB/s</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Maximum upstream kilobytes per second.</string>
			<key>pfm_name</key>
			<string>BandwidthTxKBPS</string>
			<key>pfm_title</key>
			<string>Max Upstream Bandwidth</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>kB/s</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>~/Library/Application Support/Google/DriveFS</string>
			<key>pfm_description</key>
			<string>Sets the path to the content cache location on a connected APFS or HFS+ file system.</string>
			<key>pfm_name</key>
			<string>ContentCachePath</string>
			<key>pfm_note</key>
			<string>When Drive File Stream restarts, local data in the old content cache will move to the new content cache location. If you delete your custom setting, data will move back to the default location.</string>
			<key>pfm_title</key>
			<string>Content Cache Path</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Sets the limit on content cache size in kilobytes. The limit is capped at 20% of the available space on the hard drive regardless of the setting value.</string>
			<key>pfm_name</key>
			<string>ContentCacheMaxKbytes</string>
			<key>pfm_note</key>
			<string>The setting does not apply to files made available offline or files that are in the process of uploading.</string>
			<key>pfm_title</key>
			<string>Max Content Cache Size</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>Kilobytes</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>/Volumes/GoogleDrive</string>
			<key>pfm_description</key>
			<string>Set the mounted drive path. You can include tilde (~) or environment variables in the path.</string>
			<key>pfm_name</key>
			<string>DefaultMountPoint</string>
			<key>pfm_title</key>
			<string>Default Mount Point</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>39</string>
			<key>pfm_description</key>
			<string>Disables the Microsoft Outlook Meet plugin that's bundled with Drive File Stream.</string>
			<key>pfm_name</key>
			<string>DisableMeetOutlookPlugin</string>
			<key>pfm_title</key>
			<string>Disable Meet Outlook Plugin</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Disables the Microsoft Outlook Google Drive attachment plugin that's bundled with Drive File Stream.</string>
			<key>pfm_name</key>
			<string>DisableOutlookPlugin</string>
			<key>pfm_title</key>
			<string>Disable Outlook Plugin</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Disables real-time presence in Microsoft Office (https://support.google.com/drive/answer/7329379#realtime)</string>
			<key>pfm_name</key>
			<string>DisableRealTimePresence</string>
			<key>pfm_note</key>
			<string>This can also be disabled for organizational units from the Admin console. See step 4 of Deploy Drive File Stream (https://support.google.com/a/answer/7491144).</string>
			<key>pfm_title</key>
			<string>Disable Real Time Presence</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Use browser authentication.</string>
			<key>pfm_name</key>
			<string>ForceBrowserAuth</string>
			<key>pfm_note</key>
			<string>If your organization uses security keys or SSO, this setting may resolve sign-in problems.</string>
			<key>pfm_title</key>
			<string>Force Browser Authentication</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Controls the amount of local space used by Drive File Stream's cache. Stops writing content to the disk when free disk space gets below this threshold, in kilobytes.</string>
			<key>pfm_name</key>
			<string>MinFreeDiskSpaceKBytes</string>
			<key>pfm_title</key>
			<string>Minimum Free Disk Space</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>Kilobytes</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This bypasses proxy configurations. </string>
			<key>pfm_name</key>
			<string>DirectConnection</string>
			<key>pfm_title</key>
			<string>Direct Connection</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This disables checking Certificate Revocation Lists (CRLs) provided by certificate authorities. If not explicitly set, this defaults to true if TrustedRootCertsFile is provided, otherwise false.</string>
			<key>pfm_name</key>
			<string>DisableCRLCheck</string>
			<key>pfm_note</key>
			<string>Sites that use self-signed certificates for their content inspection proxies typically don't provide a CRL.

Enterprises that specify a CRL in their proxy certificate can explicitly set DisableCRLCheck to 0 for the added check.</string>
			<key>pfm_title</key>
			<string>Disable CRL Check</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This disables validating SSL traffic. Traffic will still be encrypted, but we will not validate that the SSL certificates of the upstream servers are all valid.</string>
			<key>pfm_name</key>
			<string>DisableSSLValidation</string>
			<key>pfm_note</key>
			<string>This is inherently insecure. It would allow a man-in-the-middle attack against traffic to Google Drive. Only settable host-wide.</string>
			<key>pfm_title</key>
			<string>Disable SSL Validation</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This is the full path to an alternate file to use for validating host SSL certificates. It must be in Privacy Enhanced Mail (PEM) format. Set this if your users are on networks with decrypting proxies.</string>
			<key>pfm_name</key>
			<string>TrustedRootCertsFile</string>
			<key>pfm_note</key>
			<string>The file should contain the contents of the roots.pem file shipped with Drive File Stream, plus the certificates used to authenticate your proxy. These additions should correspond to the proxy-signing certificates you added to the certificate stores in your fleet of machines.

You can find roots.pem in /Applications/Google\ Drive\ File\ Stream.app/Contents/Resources/roots.pem. Only settable host-wide.</string>
			<key>pfm_title</key>
			<string>Trusted Root Certs File</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Google Drive File Stream</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
