<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Enterprise Connect settings</string>
	<key>pfm_domain</key>
	<string>com.apple.Enterprise-Connect</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>exclusive</string>
	<key>pfm_last_modified</key>
	<date>2021-12-22T06:06:42Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>Password</string>
				<string>Connection</string>
				<string>Shares</string>
				<string>Smart Card</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Connection</key>
				<array>
					<string>checkForNetworkType</string>
					<string>checkForNetworkServer</string>
					<string>connectDelay</string>
					<string>connectionCompletedScriptPath</string>
					<string>dailyReconnectTime</string>
					<string>connectReminderNagInterval</string>
					<string>runAuditScript</string>
					<string>runAuditScriptPath</string>
				</array>
				<key>General</key>
				<array>
					<string>launchAtLogin</string>
					<string>runPeriodicStateCheck</string>
					<string>orgUsernameLabel</string>
					<string>prepopulatedUsername</string>
					<string>preferredDC</string>
					<string>setupReminderNagInterval</string>
					<string>getRenewableTGT</string>
					<string>showMenuExtra</string>
					<string>checkShowLegacyCertificates</string>
					<string>showKeychainIdentities</string>
					<string>disableQuitMenu</string>
					<string>debugMode</string>
					<string>orgLogoPath</string>
				</array>
				<key>Password</key>
				<array>
					<string>syncLocalPassword</string>
					<string>pwReqComplexity</string>
					<string>pwReqComplexityDisableUnicode</string>
					<string>pwReqLength</string>
					<string>pwReqText</string>
					<string>pwReqHistoryCount</string>
					<string>pwReqMinimumPasswordAge</string>
					<string>disablePasswordFunctions</string>
					<string>disablePasswordExpirationChecking</string>
					<string>runPasswordChangeScriptOnLocalPasswordSync</string>
					<string>passwordChangeScriptPath</string>
					<string>passwordChangeURL</string>
					<string>passwordExpireOverride</string>
					<string>passwordNotificationDays</string>
				</array>
				<key>Shares</key>
				<array>
					<string>mountNetworkHomeDirectory</string>
					<string>pfc_preventUserShares</string>
					<string>shares</string>
					<string>managedshares</string>
					<string>shareMountWaitSeconds</string>
				</array>
				<key>Smart Card</key>
				<array>
					<string>smartCardMode</string>
					<string>showUsernameWithSmartcard</string>
					<string>destroyKerbTicketUponCardRemoval</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Enterprise Connect settings</string>
			<key>pfm_description</key>
			<string>Description of the payload.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Enterprise Connect</string>
			<key>pfm_description</key>
			<string>Name of the payload.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.Enterprise-Connect</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.Enterprise-Connect</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The host name of your organization's Active Directory domain.</string>
			<key>pfm_description_reference</key>
			<string>The host name of your organization's Active Directory domain. This is blank by default. Example - ad.pretendco.com</string>
			<key>pfm_name</key>
			<string>adRealm</string>
			<key>pfm_title</key>
			<string>Active Directory Realm</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>checkForNetworkType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The host Enterprise Connect should check for when connecting.</string>
			<key>pfm_description_reference</key>
			<string>Set this to the host Enterprise Connect should check for when connecting. This is blank by default. Only set if you set the above key to "true."</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>checkForNetworkType</string>
						</dict>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>checkForNetworkType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>checkForNetworkServer</string>
			<key>pfm_title</key>
			<string>Network Server</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Check for a host in your organization's network.</string>
			<key>pfm_description_reference</key>
			<string>Tells Enterprise Connect how to check for your organization's network. Set to "false" for default behavior, and set to "true" to check for a specific host. Should you do this, you must also set checkForNetworkServer.</string>
			<key>pfm_name</key>
			<string>checkForNetworkType</string>
			<key>pfm_title</key>
			<string>Check For Network Server</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Automatically check the "Show Legacy Certificates" option in the certificate chooser window.</string>
			<key>pfm_description_reference</key>
			<string>This value, if set, tells Enterprise Connect PKI to automatically check the "Show Legacy Certificates" option in the certificate chooser window. The default value is false.</string>
			<key>pfm_name</key>
			<string>checkShowLegacyCertificates</string>
			<key>pfm_title</key>
			<string>Show Legacy Certificates</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_description</key>
			<string>Delay starting the connection process when your organization's network is detected. This may be useful for customers who use Cisco NAC and need to delay connection while host checks are performed.</string>
			<key>pfm_description_reference</key>
			<string>This value, if set, tells Enterprise Connect to delay starting its connection process when your organization's network is detected. This may be useful for customers who use Cisco NAC and need to delay connection while host checks are
performed. Set connectDelay to the value in seconds that you need to delay connections for. The default value is 0.</string>
			<key>pfm_name</key>
			<string>connectDelay</string>
			<key>pfm_title</key>
			<string>Connect Delay</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.0</string>
			<key>pfm_default</key>
			<integer>86400</integer>
			<key>pfm_description</key>
			<string>The interval, in seconds, between connection reminders.</string>
			<key>pfm_description_reference</key>
			<string>The interval, in seconds, between connection reminders. The default is 86400 (24 hours).</string>
			<key>pfm_name</key>
			<string>connectReminderNagInterval</string>
			<key>pfm_title</key>
			<string>Connection Reminder Interval</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Path to the connection completed script.</string>
			<key>pfm_description_reference</key>
			<string>Path where Enterprise Connect looks for a Connection Completed script.</string>
			<key>pfm_name</key>
			<string>connectionCompletedScriptPath</string>
			<key>pfm_title</key>
			<string>Connection Completed Script Path</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>86400</integer>
			<key>pfm_description</key>
			<string>The interval, in seconds, that Enterprise Connect should attempt its daily reconnect. Set this to 0 to disable the daily reconnect.</string>
			<key>pfm_description_reference</key>
			<string>The interval, in seconds, that Enterprise Connect should attempt its daily reconnect. The default value is 86400 (24 hours). Set this to 0 to disable the daily reconnect.</string>
			<key>pfm_name</key>
			<string>dailyReconnectTime</string>
			<key>pfm_title</key>
			<string>Daily Reconnect Time</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Enables debugging mode.</string>
			<key>pfm_description_reference</key>
			<string>This key, if set to true, enables debugging mode. The default value is false.</string>
			<key>pfm_name</key>
			<string>debugMode</string>
			<key>pfm_title</key>
			<string>Debug Mode</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.0</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_description_reference</key>
			<string>If set to false, the user's Kerberos ticket will not be destroyed upon smart card removal. The default value is true.</string>
			<key>pfm_name</key>
			<string>destroyKerbTicketUponCardRemoval</string>
			<key>pfm_title</key>
			<string>Destroy Kerberos Ticket on Smart Card Removal</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Disable Enterprise Connect's password expiration checking, but still leave intact the ability for the user to change their password with Enterprise Connect.</string>
			<key>pfm_description_reference</key>
			<string>Set this key to true to disable Enterprise Connect's password expiration checking, but still leave intact the ability for the user to change their password with Enterprise Connect.</string>
			<key>pfm_name</key>
			<string>disablePasswordExpirationChecking</string>
			<key>pfm_title</key>
			<string>Disable Password Expiration Checking</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Disable Enterprise Connect's password management abilities, including expiration notices and the "Change Password" menu item. This is useful for customers who don't change their passwords in AD.</string>
			<key>pfm_description_reference</key>
			<string>Set this key to true to disable Enterprise Connect's password management abilities, including expiration notices and the "Change Password" menu item. This is useful for customers who don't change their passwords in AD. The default value is false.</string>
			<key>pfm_name</key>
			<string>disablePasswordFunctions</string>
			<key>pfm_title</key>
			<string>Disable Password Functions</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_deprecated</key>
			<string>2.0</string>
			<key>pfm_app_max</key>
			<string>2.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Disables the Quit menu item from Enterprise Connect.</string>
			<key>pfm_description_reference</key>
			<string>Set this key to true to remove the Quit menu item from Enterprise Connect. The default value is false.</string>
			<key>pfm_name</key>
			<string>disableQuitMenu</string>
			<key>pfm_title</key>
			<string>Disable Quit Menu</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Acquire a renewable Kerberos TGT.</string>
			<key>pfm_description_reference</key>
			<string>If set to true, Enterprise Connect will acquire a renewable Kerberos TGT. The default value is false.</string>
			<key>pfm_name</key>
			<string>getRenewableTGT</string>
			<key>pfm_title</key>
			<string>Get Renewable TGT</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_deprecated</key>
			<string>2.0</string>
			<key>pfm_app_max</key>
			<string>2.0</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Determines if Enterprise Connect should set itself as a login item.</string>
			<key>pfm_description_reference</key>
			<string>Set this key to false to prevent Enterprise Connect from setting itself as a login item. The default value is true.</string>
			<key>pfm_name</key>
			<string>launchAtLogin</string>
			<key>pfm_title</key>
			<string>Launch At Login</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>List of shares that Enterprise Connect should attempt to mount. Users will still be able to add their own shares.</string>
			<key>pfm_description_reference</key>
			<string>This key contains a list of shares that Enterprise Connect should attempt to mount. Users will still be able to add their own shares. This key is an array which contains a dictionary for each share you wish to mount. See the sample configuration profile included with Enterprise Connect for an example. The default value is blank.</string>
			<key>pfm_name</key>
			<string>managedshares</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>managedshare</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>path</string>
							<key>pfm_title</key>
							<string>Path</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>smb://pretendco.com/myshare</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Share</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Managed Shares</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Determines if Enterprise Connect mounts the user's network home directory.</string>
			<key>pfm_description_reference</key>
			<string>Determines if Enterprise Connect mounts the user's network home directory. This is "false" by default. Set to "true" to enable.</string>
			<key>pfm_name</key>
			<string>mountNetworkHomeDirectory</string>
			<key>pfm_title</key>
			<string>Mount Network Home Directory</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.0</string>
			<key>pfm_description</key>
			<string>The path to a file containing your organization's logo, in PNG, JPG or GIF format.</string>
			<key>pfm_description_reference</key>
			<string>The path to a file containing your organization's logo, in PNG, JPG or GIF format.</string>
			<key>pfm_name</key>
			<string>orgLogoPath</string>
			<key>pfm_title</key>
			<string>Organization Logo Path</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.0</string>
			<key>pfm_description</key>
			<string>The name your organization gives usernames.</string>
			<key>pfm_description_reference</key>
			<string>The name your organization gives usernames.</string>
			<key>pfm_name</key>
			<string>orgUsernameLabel</string>
			<key>pfm_title</key>
			<string>Organization Username Label</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Path to the password change script.</string>
			<key>pfm_description_reference</key>
			<string>Path where Enterprise Connect looks for password change script.</string>
			<key>pfm_name</key>
			<string>passwordChangeScriptPath</string>
			<key>pfm_title</key>
			<string>Password Change Script Path</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>URL to open in the user's default web browser when they use Enterprise Connect to change their password. Standard password change functionality will no longer work.</string>
			<key>pfm_description_reference</key>
			<string>If set, Enterprise Connect will open this URL in the user's default web browser when they use Enterprise Connect to change their password. Standard password change functionality will no longer work. (Example - https://reset.pretendco.com/ForgotPass)</string>
			<key>pfm_name</key>
			<string>passwordChangeURL</string>
			<key>pfm_title</key>
			<string>Password Change URL</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Override domain password policy when calculating password expiration.</string>
			<key>pfm_description_reference</key>
			<string>Use this value to override domain password policy when calculating password expiration. The default value is blank.</string>
			<key>pfm_name</key>
			<string>passwordExpireOverride</string>
			<key>pfm_title</key>
			<string>Password Expire Override</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>15</integer>
			<key>pfm_description</key>
			<string>Determines the amount of days before password expiration that the user receives expiration notifications.</string>
			<key>pfm_description_reference</key>
			<string>Determines the amount of days before password expiration that the user receives expiration notifications. The default value is 15. Set this to any positive value you wish.</string>
			<key>pfm_name</key>
			<string>passwordNotificationDays</string>
			<key>pfm_title</key>
			<string>Password Expire Notification</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>days</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Prevents the user from adding custom shares to Enterprise Connect.</string>
			<key>pfm_description_reference</key>
			<string></string>
			<key>pfm_excluded</key>
			<true/>
			<key>pfm_name</key>
			<string>pfc_preventUserShares</string>
			<key>pfm_title</key>
			<string>Prevent User Shares</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Preferred domain controller when doing LDAP queries and getting a Kerberos TGT. If this domain controller is unavailable, Enterprise Connect will fall back to domain controllers it discovers from DNS.</string>
			<key>pfm_description_reference</key>
			<string>Tells Enterprise Connect to prefer the specified domain controller when doing LDAP queries and getting a Kerberos TGT. If this domain controller is unavailable, Enterprise Connect will fall back to domain controllers it discovers from DNS.</string>
			<key>pfm_name</key>
			<string>preferredDC</string>
			<key>pfm_title</key>
			<string>Preferred Domain Controller</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Upon launch or sign out, Enterprise Connect will pre-populate the Username field with this username.</string>
			<key>pfm_description_reference</key>
			<string>Upon launch or sign out, Enterprise Connect will pre-populate the Username field with this username. The default value is empty.</string>
			<key>pfm_name</key>
			<string>prepopulatedUsername</string>
			<key>pfm_title</key>
			<string>Pre Populated Username</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Tells Enterprise Connect that passwords should meet Active Directory's definition of complexity. Used to enable and configure live password testing.</string>
			<key>pfm_description_reference</key>
			<string>Tells Enterprise Connect that passwords should meet Active Directory's definition of complexity. Used to enable and configure live password testing. The default value is false.</string>
			<key>pfm_name</key>
			<string>pwReqComplexity</string>
			<key>pfm_title</key>
			<string>Password Required Complexity</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Disables the "Has a Unicode character" password test from live password testing.</string>
			<key>pfm_description_reference</key>
			<string>If set to true, the "Has a Unicode character" password test is removed from live password testing. The default value is false.</string>
			<key>pfm_name</key>
			<string>pwReqComplexityDisableUnicode</string>
			<key>pfm_title</key>
			<string>Password Required Complexity Disable Unicode</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.0</string>
			<key>pfm_description</key>
			<string>How many previous passwords cannot be re-used.</string>
			<key>pfm_description_reference</key>
			<string>Tells Enterprise Connect how many previous passwords cannot be re-used. The default value is null</string>
			<key>pfm_name</key>
			<string>pwReqHistoryCount</string>
			<key>pfm_title</key>
			<string>Password History Count</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Require passwords to be at least as long as the specified value.</string>
			<key>pfm_description_reference</key>
			<string>Tells Enterprise Connect that passwords should be at least as long as the specified value. Used to enable and configure live password testing. The default value is null.</string>
			<key>pfm_name</key>
			<string>pwReqLength</string>
			<key>pfm_title</key>
			<string>Password Required Length</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.0</string>
			<key>pfm_description</key>
			<string>The minimum age of passwords before they can be changed.</string>
			<key>pfm_description_reference</key>
			<string>Tells Enterprise Connect the minimum age of passwords before they can be changed. The default value is null.</string>
			<key>pfm_name</key>
			<string>pwReqMinimumPasswordAge</string>
			<key>pfm_title</key>
			<string>Password Minimum Age</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>days</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Path to a RTF file to display for the user during password changes.</string>
			<key>pfm_description_reference</key>
			<string>Tells Enterprise Connect to display the specified RTF file for the user during password changes. Supply the path to the RTF file you want to display. The default value is null.</string>
			<key>pfm_name</key>
			<string>pwReqText</string>
			<key>pfm_title</key>
			<string>Password Change Message Path</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Tells Enterprise Connect to execute an audit script.</string>
			<key>pfm_description_reference</key>
			<string>Tells Enterprise Connect to execute an audit script.</string>
			<key>pfm_name</key>
			<string>runAuditScript</string>
			<key>pfm_title</key>
			<string>Run Audit Script</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Path to the audit script.</string>
			<key>pfm_description_reference</key>
			<string>Path where Enterprise Connect looks for an audit script.</string>
			<key>pfm_name</key>
			<string>runAuditScriptPath</string>
			<key>pfm_title</key>
			<string>Audit Script Path</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Determines if Enterprise Connect should run the password change script upon a local password sync.</string>
			<key>pfm_description_reference</key>
			<string>If set to false, Enterprise Connect will not run the password change script upon a local password sync. The default value is true.</string>
			<key>pfm_name</key>
			<string>runPasswordChangeScriptOnLocalPasswordSync</string>
			<key>pfm_title</key>
			<string>Run Password Change Script On Local Password Sync</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Enable or Disable periodic state checking. Customers who expose their DNS to the public Internet will need to disable periodic state checking.</string>
			<key>pfm_description_reference</key>
			<string>This value, if set to false, tells Enterprise Connect to disable periodic state checking. Customers who expose their DNS to the public Internet will need to disable periodic state checking. The default value is true.</string>
			<key>pfm_name</key>
			<string>runPeriodicStateCheck</string>
			<key>pfm_title</key>
			<string>Run Periodic State Check</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.0</string>
			<key>pfm_default</key>
			<integer>86400</integer>
			<key>pfm_description</key>
			<string>The interval, in seconds, between setup notifications.</string>
			<key>pfm_description_reference</key>
			<string>The interval, in seconds, between setup notifications. The default value is 86400 (24 hours).</string>
			<key>pfm_name</key>
			<string>setupReminderNagInterval</string>
			<key>pfm_title</key>
			<string>Reminder Nag Interval</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_description</key>
			<string>Delay the mounting of network shares when your organization's network is detected. This may be useful for customers who use Cisco NAC and need to delay connection while host checks are performed.</string>
			<key>pfm_description_reference</key>
			<string>This value, if set, tells Enterprise Connect to delay the mounting of network shares when your organization's network is detected. This may be useful for customers who use Cisco NAC and need to delay connection while host checks are performed. Set shareMountWaitSeconds to the value in seconds that you need to delay share mounting for. The default value is 0.</string>
			<key>pfm_name</key>
			<string>shareMountWaitSeconds</string>
			<key>pfm_title</key>
			<string>Share Mount Delay</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>pfc_preventUserShares</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<array>
				<dict/>
			</array>
			<key>pfm_description</key>
			<string>List of shares that Enterprise Connect should attempt to mount.</string>
			<key>pfm_description_reference</key>
			<string>This key contains a list of shares that Enterprise Connect should attempt to mount. This key is an array which contains a dictionary for each share you wish to mount. The default value is blank.</string>
			<key>pfm_hidden</key>
			<string>all</string>
			<key>pfm_name</key>
			<string>shares</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>managedshare</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>path</string>
							<key>pfm_title</key>
							<string>Path</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>smb://pretendco.com/myshare</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Share</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Shares</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Automatically check the "Show Legacy Certificates" option in the certificate chooser window.</string>
			<key>pfm_description_reference</key>
			<string>If enabled, identities in the user's default keychain will be available to choose in the certificate chooser window. The default value is false.</string>
			<key>pfm_name</key>
			<string>showKeychainIdentities</string>
			<key>pfm_title</key>
			<string>Show Keychain Identities</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.0</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Determines whether the Enterprise Connect menu extra is loaded.</string>
			<key>pfm_description_reference</key>
			<string>Determines whether the Enterprise Connect menu extra is loaded. The default value is true.</string>
			<key>pfm_name</key>
			<string>showMenuExtra</string>
			<key>pfm_title</key>
			<string>Show Menu Extra</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Determines if Enterprise Connect should display the username field if smart card mode is enabled.</string>
			<key>pfm_description_reference</key>
			<string>Determines if Enterprise Connect should display the username field if smart card mode is enabled. The default value is false.</string>
			<key>pfm_name</key>
			<string>showUsernameWithSmartcard</string>
			<key>pfm_title</key>
			<string>Show Username in Smart Card Mode</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Determines whether smart card mode should be enabled.</string>
			<key>pfm_description_reference</key>
			<string>Determines whether smart card mode should be enabled. The default value is false.</string>
			<key>pfm_name</key>
			<string>smartCardMode</string>
			<key>pfm_title</key>
			<string>Enable Smart Card Mode</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enables Active Directory to local account password sync. This only works if the user is logged into their Mac with a local account.</string>
			<key>pfm_description_reference</key>
			<string>Enables Active Directory to local account password sync. This only works if the user is logged into their Mac with a local account. Set to "true" to enable.</string>
			<key>pfm_name</key>
			<string>syncLocalPassword</string>
			<key>pfm_title</key>
			<string>Sync Local Password</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Enterprise Connect</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>3</integer>
</dict>
</plist>
