<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Microsoft Defender Advanced Threat Protection settings</string>
	<key>pfm_documentation_url</key>
	<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences</string>
	<key>pfm_domain</key>
	<string>com.microsoft.wdav</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2020-03-26T22:45:00Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Microsoft Defender Advanced Threat Protection settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Microsoft Defender Advanced Threat Protection</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.microsoft.wdav</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited. Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.microsoft.wdav</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Manages the preferences of the antivirus component of Microsoft Defender ATP.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#antivirus-engine-preferences</string>
			<key>pfm_name</key>
			<string>antivirusEngine</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Enables / disables real-time protection, which scans files as they are accessed.</string>
					<key>pfm_description_reference</key>
					<string>Specify whether to enable real-time protection, which scans files as they are accessed.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#enable--disable-real-time-protection</string>
					<key>pfm_name</key>
					<string>enableRealTimeProtection</string>
					<key>pfm_title</key>
					<string>Enable Real-Time Protection</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>100.67.60</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Specify whether the antivirus engine runs in passive mode.</string>
					<key>pfm_description_reference</key>
					<string>Specify whether to enable real-time protection, which scans files as they are accessed.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#enable--disable-passive-mode</string>
					<key>pfm_name</key>
					<string>passiveMode</string>
					<key>pfm_note</key>
					<string>Passive mode has the following implications:

- Real-time protection is turned off
- On-demand scanning is turned on
- Automatic threat remediation is turned off
- Security intelligence updates are turned on
- Status menu icon is hidden</string>
					<key>pfm_title</key>
					<string>Enable Passive Mode</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Manages the preferences of the antivirus component of Microsoft Defender ATP.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#scan-exclusions</string>
					<key>pfm_name</key>
					<string>exclusions</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_hidden</key>
							<string>container</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>Specify content excluded from being scanned by type.</string>
									<key>pfm_documentation_url</key>
									<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#type-of-exclusion</string>
									<key>pfm_name</key>
									<string>$type</string>
									<key>pfm_range_list</key>
									<array>
										<string>excludedPath</string>
										<string>excludedFileExtension</string>
										<string>excludedFileName</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Path</string>
										<string>File Extension</string>
										<string>Filename</string>
									</array>
									<key>pfm_title</key>
									<string>Exclusion Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Specify content excluded from being scanned by full file path.</string>
									<key>pfm_documentation_url</key>
									<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#path-to-excluded-content</string>
									<key>pfm_exclude</key>
									<array>
										<dict>
											<key>pfm_target_conditions</key>
											<array>
												<dict>
													<key>pfm_range_list</key>
													<array>
														<string>excludedFileExtension</string>
														<string>excludedFileName</string>
													</array>
													<key>pfm_target</key>
													<string>$type</string>
												</dict>
											</array>
										</dict>
									</array>
									<key>pfm_name</key>
									<string>path</string>
									<key>pfm_title</key>
									<string>Path</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>Indicate if the path property refers to a file or directory.</string>
									<key>pfm_documentation_url</key>
									<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#path-type-file--directory</string>
									<key>pfm_exclude</key>
									<array>
										<dict>
											<key>pfm_target_conditions</key>
											<array>
												<dict>
													<key>pfm_n_range_list</key>
													<array>
														<string>excludedPath</string>
													</array>
													<key>pfm_target</key>
													<string>$type</string>
												</dict>
											</array>
										</dict>
									</array>
									<key>pfm_name</key>
									<string>isDirectory</string>
									<key>pfm_title</key>
									<string>Directory</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Specify content excluded from being scanned by file extension.</string>
									<key>pfm_documentation_url</key>
									<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#file-extension-excluded-from-the-scan</string>
									<key>pfm_exclude</key>
									<array>
										<dict>
											<key>pfm_target_conditions</key>
											<array>
												<dict>
													<key>pfm_n_range_list</key>
													<array>
														<string>excludedFileExtension</string>
													</array>
													<key>pfm_target</key>
													<string>$type</string>
												</dict>
											</array>
										</dict>
									</array>
									<key>pfm_name</key>
									<string>extension</string>
									<key>pfm_title</key>
									<string>File Extension</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Specify a process for which all file activity is excluded from scanning. The process can be specified either by its name (e.g. cat) or full path (e.g. /bin/cat).</string>
									<key>pfm_documentation_url</key>
									<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#process-excluded-from-the-scan</string>
									<key>pfm_exclude</key>
									<array>
										<dict>
											<key>pfm_target_conditions</key>
											<array>
												<dict>
													<key>pfm_n_range_list</key>
													<array>
														<string>excludedFileName</string>
													</array>
													<key>pfm_target</key>
													<string>$type</string>
												</dict>
											</array>
										</dict>
									</array>
									<key>pfm_name</key>
									<string>name</string>
									<key>pfm_title</key>
									<string>Process / Filename</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Exclusions</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Exclusions</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>100.83.73</string>
					<key>pfm_default</key>
					<string>merge</string>
					<key>pfm_description_reference</key>
					<string>Specify the merge policy for exclusions. This can be a combination of administrator-defined and user-defined exclusions (merge) or only administrator-defined exclusions (admin_only). This setting can be used to restrict local users from defining their own exclusions.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#exclusion-merge-policy</string>
					<key>pfm_name</key>
					<string>exclusionsMergePolicy</string>
					<key>pfm_range_list</key>
					<array>
						<string>merge</string>
						<string>admin_only</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Merge</string>
						<string>Admin Only</string>
					</array>
					<key>pfm_title</key>
					<string>Exclusions Merge Policy</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>Specify how certain threat types are handled by Microsoft Defender ATP for Mac.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#threat-type-settings</string>
					<key>pfm_name</key>
					<string>threatTypeSettings</string>
					<key>pfm_note</key>
					<string>Each threat type should only be listed once</string>
					<key>pfm_repetition_max</key>
					<integer>2</integer>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>Specify threat types.</string>
									<key>pfm_documentation_url</key>
									<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#threat-type</string>
									<key>pfm_name</key>
									<string>key</string>
									<key>pfm_range_list</key>
									<array>
										<string>potentially_unwanted_application</string>
										<string>archive_bomb</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Potentially Unwanted Application</string>
										<string>Archive Bomb</string>
									</array>
									<key>pfm_title</key>
									<string>Threat Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<string>audit</string>
									<key>pfm_description</key>
									<string>Specify what action to take when a threat of the type specified in the preceding section is detected. Choose from the following options:

Audit: your device is not protected against this type of threat, but an entry about the threat is logged.
Block: your device is protected against this type of threat and you are notified in the user interface and the security console.
Off: your device is not protected against this type of threat and nothing is logged.</string>
									<key>pfm_documentation_url</key>
									<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#action-to-take</string>
									<key>pfm_name</key>
									<string>value</string>
									<key>pfm_range_list</key>
									<array>
										<string>audit</string>
										<string>block</string>
										<string>off</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Audit</string>
										<string>Block</string>
										<string>Off</string>
									</array>
									<key>pfm_title</key>
									<string>Action to Take</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string></string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Threat Type Settings</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>100.83.73</string>
					<key>pfm_default</key>
					<string>merge</string>
					<key>pfm_description_reference</key>
					<string>Specify the merge policy for threat type settings. This can be a combination of administrator-defined and user-defined settings (merge) or only administrator-defined settings (admin_only). This setting can be used to restrict local users from defining their own settings for different threat types.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#threat-type-settings-merge-policy</string>
					<key>pfm_name</key>
					<string>threatTypeSettingsMergePolicy</string>
					<key>pfm_range_list</key>
					<array>
						<string>merge</string>
						<string>admin_only</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Merge</string>
						<string>Admin Only</string>
					</array>
					<key>pfm_title</key>
					<string>Threat Type Settings Merge Policy</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>Specify threats by name that are not blocked by Microsoft Defender ATP for Mac. These threats will be allowed to run.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#allowed-threats</string>
					<key>pfm_name</key>
					<string>allowedThreats</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_title</key>
							<string>Threats</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Allowed Threats</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>100.83.73</string>
					<key>pfm_description_reference</key>
					<string>Restricts the actions that the local user of a device can take when threats are detected. The actions included in this list are not displayed in the user interface.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#disallowed-threat-actions</string>
					<key>pfm_name</key>
					<string>disallowedThreatActions</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>allow</string>
								<string>restore</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Allow (restricts users from allowing threats)</string>
								<string>Restore (restricts users from restoring threats from the quarantine)</string>
							</array>
							<key>pfm_repetition_max</key>
							<integer>2</integer>
							<key>pfm_title</key>
							<string>Disallowed Threat Actions</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Disallowed Threat Actions</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Anti-Virus Engine</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Configure the cloud-driven protection features of Microsoft Defender ATP for Mac.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#cloud-delivered-protection-preferences</string>
			<key>pfm_name</key>
			<string>cloudService</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description_reference</key>
					<string>Specify whether to enable cloud-delivered protection the device or not. To improve the security of your services, we recommend keeping this feature turned on.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#enable--disable-cloud-delivered-protection</string>
					<key>pfm_name</key>
					<string>enabled</string>
					<key>pfm_title</key>
					<string>Enable / disable cloud-delivered protection</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>optional</string>
					<key>pfm_description_reference</key>
					<string>Diagnostic data is used to keep Microsoft Defender ATP secure and up-to-date, detect, diagnose and fix problems, and also make product improvements. This setting determines the level of diagnostics sent by Microsoft Defender ATP to Microsoft.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#diagnostic-collection-level</string>
					<key>pfm_name</key>
					<string>diagnosticLevel</string>
					<key>pfm_range_list</key>
					<array>
						<string>optional</string>
						<string>required</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Optional</string>
						<string>Required</string>
					</array>
					<key>pfm_title</key>
					<string>Diagnostic Collection Level</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description_reference</key>
					<string>Determines whether suspicious samples (that are likely to contain threats) are sent to Microsoft. You are prompted if the submitted file is likely to contain personal information.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#enable--disable-automatic-sample-submissions</string>
					<key>pfm_name</key>
					<string>automaticSampleSubmission</string>
					<key>pfm_title</key>
					<string>Enable / disable automatic sample submissions</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Cloud Service</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Manage the preferences for the user interface of Microsoft Defender ATP for Mac.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#endpoint-detection-and-response-preferences</string>
			<key>pfm_name</key>
			<string>edr</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description_reference</key>
					<string>Specify whether to enable EDR early preview features.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#enable--disable-early-preview</string>
					<key>pfm_name</key>
					<string>earlyPreview</string>
					<key>pfm_title</key>
					<string>Early Preview</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>Specify a tag name and its value.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#device-tags</string>
					<key>pfm_name</key>
					<string>tags</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>Specifies the type of tag</string>
									<key>pfm_documentation_url</key>
									<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#type-of-tag</string>
									<key>pfm_name</key>
									<string>key</string>
									<key>pfm_range_list</key>
									<array>
										<string>GROUP</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Group</string>
									</array>
									<key>pfm_title</key>
									<string>Tag Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Specifies the value of tag</string>
									<key>pfm_documentation_url</key>
									<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#value-of-tag</string>
									<key>pfm_name</key>
									<string>value</string>
									<key>pfm_title</key>
									<string>Tag Value</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string></string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Device Tags</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Endpoint Detection and Response Preferences</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Manage the preferences for the user interface of Microsoft Defender ATP for Mac.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#user-interface-preferences</string>
			<key>pfm_name</key>
			<string>userInterface</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description_reference</key>
					<string>Specify whether to show or hide the status menu icon in the top-right corner of the screen.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#show--hide-status-menu-icon</string>
					<key>pfm_name</key>
					<string>hideStatusMenuIcon</string>
					<key>pfm_title</key>
					<string>Show / hide status menu icon</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>User Interface Preferences</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Microsoft Defender ATP</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
