<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://particulars.app/</string>
	<key>pfm_description</key>
	<string>Particulars settings</string>
	<key>pfm_domain</key>
	<string>net.glencode.Particulars</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2021-12-02T08:52:31Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Particulars settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Particulars</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>net.glencode.Particulars</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>net.glencode.Particulars</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>By default, Particulars only displays information about the primary active network interface. To show information about all active network interfaces, set allNetworkInterfaces.</string>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_name</key>
			<string>allNetworkInterfaces</string>
			<key>pfm_title</key>
			<string>Show All Network Interfaces</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Adds a count of CPU cores to the CPU item. Changing this preference requires a restart of the application/widget to take effect.</string>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_name</key>
			<string>coreCount</string>
			<key>pfm_title</key>
			<string>Show CPU Core Count</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Sets the relative position of system information on the desktop.</string>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_name</key>
			<string>desktopPosition</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
				<integer>3</integer>
				<integer>4</integer>
				<integer>5</integer>
				<integer>6</integer>
				<integer>7</integer>
				<integer>8</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Top Left</string>
				<string>Top Center</string>
				<string>Top Right</string>
				<string>Middle Left</string>
				<string>Middle Center</string>
				<string>Middle Right</string>
				<string>Bottom Left</string>
				<string>Bottom Center</string>
				<string>Bottom Right</string>
			</array>
			<key>pfm_title</key>
			<string>Desktop Position</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Adjust detail level options. See documentation URL for instructions.</string>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_name</key>
			<string>detailLevel</string>
			<key>pfm_title</key>
			<string>Detail Level</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Particulars shows the DHCP server address and the length of the DHCP lease. Setting this preference will also show the remaining lease time.</string>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_name</key>
			<string>dhcpLeaseRemaining</string>
			<key>pfm_title</key>
			<string>Show DHCP Lease Time Remaining</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_description</key>
			<string>Free/available disk space can be displayed in multiple ways. See documentation URL for options.</string>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_name</key>
			<string>diskFreeSpace</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Free</string>
				<string>All available (including purgeable)</string>
				<string>Free and purgeable</string>
			</array>
			<key>pfm_title</key>
			<string>Show Disk Free Space</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Determines whether the system information on the desktop has a drop shadow behind it.</string>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_name</key>
			<string>dropShadow</string>
			<key>pfm_title</key>
			<string>Drop Shadow</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>On first run, Particulars displays a welcome window that describes how it runs on the Desktop and then hides all other apps and opens the preferences window. To skip this first run experience, set this preference. (Enabling labMode implies this setting.)</string>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_name</key>
			<string>firstRunDone</string>
			<key>pfm_title</key>
			<string>First Run Done</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enabling this removes Particulars from the macOS Dock. Enabling or disabling this preference from Terminal will automatically restart Particulars and open the Preferences window.</string>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_name</key>
			<string>hideDockIcon</string>
			<key>pfm_title</key>
			<string>Hide Dock Icon</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>When Particulars is running with the Dock icon shown, it will be hidden along with all other apps when you select Hide Others from another application's menu. This preference allows you to keep Particulars visible.</string>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_name</key>
			<string>ignoreHiding</string>
			<key>pfm_title</key>
			<string>Ignore Hiding</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Lab Mode eases deployment of Particulars in a computer lab or data center.</string>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_name</key>
			<string>labMode</string>
			<key>pfm_title</key>
			<string>Lab Mode</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>Sets the letter case of the labels. Each case option has a corresponding number.</string>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_name</key>
			<string>labelCase</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Unaltered</string>
				<string>lower (default)</string>
				<string>UPPER</string>
			</array>
			<key>pfm_title</key>
			<string>Label Case</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>Particulars has 3 options for the shade of the output: automatic, light text, or dark text.</string>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_name</key>
			<string>lightDarkText</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Automatic</string>
				<string>Light text (default)</string>
				<string>Dark text</string>
			</array>
			<key>pfm_title</key>
			<string>Light or Dark Text</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>By default, MAC (Media Access Control) addresses are formatted with colon separators and in lowercase. Use this preference to select another MAC address format.</string>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_name</key>
			<string>macAddressFormat</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
				<integer>3</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Plain (example: 0123456789ab)</string>
				<string>Unix (default, example: 01:23:45:67:89:ab)</string>
				<string>Cisco (example: 0123.4567.89ab)</string>
				<string>Windows/IEEE (example: 01-23-45-67-89-AB)</string>
			</array>
			<key>pfm_title</key>
			<string>MAC Address Format</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>By default, all network information is displayed. It is possible to construct a custom set of network information. Use this preference to create a custom network detail level. See documentation URL for instructions.</string>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_name</key>
			<string>networkDetailLevel</string>
			<key>pfm_title</key>
			<string>Network Detail Level</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>When enabled, Particulars will post system notifications when it detects a change in the primary IPv4 address or the public IP address. Notifications are also governed by settings in the Notifications preference pane in System Preferences.</string>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_name</key>
			<string>networkNotifications</string>
			<key>pfm_title</key>
			<string>Show Network Notifications</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This preference adds the operating system version's marketing name (e.g., Big Sur, Catalina, etc) to the Operating system particular output.</string>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_name</key>
			<string>operatingSystemVersionName</string>
			<key>pfm_title</key>
			<string>Show Operating System Version Name</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Sets the display (or monitor) on which Particulars will show system information. If the display is later unavailable, Particulars will default back to the primary display. The value is an integer, taking 2 for the 2nd display, for example.</string>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_name</key>
			<string>preferredDisplay</string>
			<key>pfm_title</key>
			<string>Preferred Display</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Adds an item to the macOS menu bar that allows quick access to preferences, copying, and other functions.</string>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_name</key>
			<string>showMenuBarExtra</string>
			<key>pfm_title</key>
			<string>Show Menu Bar Extra</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Use this preference to have Particulars display subnet masks in the short CIDR (Classless Inter-domain Routing) notation. For example, 255.255.254.0 will show as /23.</string>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_name</key>
			<string>subnetMaskCIDRNotation</string>
			<key>pfm_title</key>
			<string>Subnet Mask CIDR Notation</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Sets the text size. The default is 18. Values between 12 and 24 are typical.</string>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_name</key>
			<string>textSize</string>
			<key>pfm_title</key>
			<string>Text Size</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_description</key>
			<string>Sets the text theme. Each theme has a corresponding number.</string>
			<key>pfm_documentation_url</key>
			<string>https://particulars.app/_help/particularshelp/Lab-Mode.html</string>
			<key>pfm_name</key>
			<string>textTheme</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
				<integer>255</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Default (Lato)</string>
				<string>System</string>
				<string>Mono</string>
				<string>Custom</string>
			</array>
			<key>pfm_title</key>
			<string>Text Theme</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Particulars</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
